#include <stdio.h>
int main() {
	unsigned char A[16] = {10, 20, 30, 40, 50, 60, 70, 80, 90, 100, 110, 120, 130, 140, 150, 160};
	unsigned char B[15] = {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0};
	int count = 0;
	asm (
	    "mov $15, %%ecx\n" // счетчик цикла

	    "lea (%1), %%esi\n" // адрес A в регистр esi
	    "lea (%2), %%edi\n" // адрес B в регистр edi
	    //"lea (%3), %%edx\n" // адрес C в регистр edx

	    "l:\n"
	    "mov (%%esi), %%al\n" // загрузка A[i] в регистр al
	    "sub (%%esi, 1), %%al\n" // вычисление разности A[i] - A[i+1]
	    "mov %%al, (%%edi)\n" // сохранение значения в B[i]
	    "test %%al, %%al\n" // проверка на отрицательность
	    "jns e\n" // переход на метку end_label, если нет отрицательности

	    "movb $0, (%%edi)\n"
	    //"movb $15, (%%edx)\n" // добавляем букву 'b' для байта
	    //"sub %%ecx, (%%edx)\n" // вычитание счетчика цикла из значения C[i]
	    //"inc %%edx\n" // инкремент указателя на массив C
	    //"inc %%ebx\n" // инкремент счетчика отрицательных значений

	    "e:\n" // метка для конца блока условной инструкции
	    "inc %%esi\n" // инкремент указателя на массив A
	    "inc %%edi\n" // инкремент указателя на массив B
	    "loop l\n"

	    //"mov %%ebx, %0\n"

	    : "=m" (count) // выход
	    : "r" (A), "r" (B), "r" (C) // вход
	    : "eax", "ecx", "esi", "edi", "edx" // упоминание зарезервированных регистров
	);

/*	for (int i = 0; i < 15; i++) {
		printf("%d ", B[i]);
	}
	printf("\n");
	for (int i = 0; i < count; i++) {
		printf("%d ", C[i]);
	}
	printf("count = %d\n", count);*/
	return 0;
}